---
kind: method
id: M:Autodesk.Revit.DB.Macros.MacroManager.GetBasicIEnumerator
source: html/52c5bee7-80b1-a1a2-b01b-e1c3a13460d0.htm
---
# Autodesk.Revit.DB.Macros.MacroManager.GetBasicIEnumerator Method

Returns an enumerator that iterates through a collection.

## Syntax (C#)
```csharp
internal virtual IEnumerator GetBasicIEnumerator()
```

## Returns
An IEnumerator object that can be used to iterate through the collection.